import fetch from 'node-fetch'

let handler = async (m, { conn, args }) => {
    await m.react('🍒')
let mentionedJid = await m.mentionedJid
let userId = mentionedJid && mentionedJid[0] ? mentionedJid[0] : m.sender
let totalreg = Object.keys(global.db.data.users).length
let totalCommands = Object.values(global.plugins).filter((v) => v.help && 
v.tags).length
    
let txt = `
> ꒰⌢ ʚ˚₊‧ ✎ ꒱ 𝗡𝗜𝗡𝗢 𝗡𝗔𝗞𝗔𝗡𝗢-𝗜𝗔 𝗨𝗣𝗗𝗔𝗧𝗘 🌷 
> ﹙✐﹚ *¡Hola* @${userId.split('@')[0]}! 
> ﹙✐﹚ *Soy ${botname}*
> ﹙✐﹚ Tipo » ${(conn.user.jid == global.conn.user.jid ? 'Principal' : 'Sub-Bot')}
> ﹙✐﹚ *Usuarios » ${totalreg.toLocaleString()}*
> ﹙✐﹚ *Versión » ${vs}*
> ﹙✐﹚ *Plugins » ${totalCommands}*
> ﹙✐﹚ *Librería » ${libreria}*

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ՏIՏTᗴᗰᗩ ᗪᗴ ᗴᑕOᑎOᗰIᗩ* ❐
> ﹙✐﹚ *Comandos de economía para ganar dinero*

> ﹙✐﹚ ⚘ 𝙬𝙤𝙧𝙠 • 𝙩𝙧𝙖𝙗𝙖𝙟𝙖𝙧
> ﹙✐﹚ ⚘ 𝙥𝙧𝙤𝙨𝙩𝙞𝙩𝙪𝙞𝙧𝙨𝙚 • 𝙨𝙡𝙪𝙩
> ﹙✐﹚ ⚘ 𝙘𝙤𝙞𝙣𝙛𝙡𝙞𝙥 • 𝙛𝙡𝙞𝙥 • 𝙘𝙛 + [cantidad] <cara/cruz>
> ﹙✐﹚ ⚘ 𝙘𝙧𝙞𝙢𝙚 • 𝙘𝙧𝙞𝙢𝙚𝙣
> ﹙✐﹚ ⚘ 𝙧𝙤𝙪𝙡𝙚𝙩𝙩𝙚 • 𝙧𝙩 + [red/black] [cantidad]
> ﹙✐﹚ ⚘ 𝙘𝙖𝙨𝙞𝙣𝙤 • 𝙖𝙥𝙤𝙨𝙩𝙖𝙧 • 𝙨𝙡𝙤𝙩 + [cantidad]
> ﹙✐﹚ ⚘ 𝙗𝙖𝙡𝙖𝙣𝙘𝙚 • 𝙗𝙖𝙡 • 𝙗𝙖𝙣𝙠 + <usuario>
> ﹙✐﹚ ⚘ 𝙙𝙚𝙥𝙤𝙨𝙞𝙩 • 𝙙𝙚𝙥 • 𝙙 + [cantidad] | all
> ﹙✐﹚ ⚘ 𝙬𝙞𝙩𝙝𝙙𝙧𝙖𝙬 • 𝙬𝙞𝙩𝙝 • 𝙧𝙚𝙩𝙞𝙧𝙖𝙧 + [cantidad] | all
> ﹙✐﹚ ⚘ 𝙚𝙘𝙤𝙣𝙤𝙢𝙮𝙞𝙣𝙛𝙤 • 𝙚𝙞𝙣𝙛𝙤
> ﹙✐﹚ ⚘ 𝙜𝙞𝙫𝙚𝙘𝙤𝙞𝙣𝙨 • 𝙥𝙖𝙮 + [usuario] [cantidad]
> ﹙✐﹚ ⚘ 𝙢𝙞𝙣𝙞𝙣𝙜 • 𝙢𝙞𝙣𝙖𝙧 • 𝙢𝙞𝙣𝙚
> ﹙✐﹚ ⚘ 𝙙𝙖𝙞𝙡𝙮 • 𝙙𝙞𝙖𝙧𝙞𝙤
> ﹙✐﹚ ⚘ 𝙘𝙤𝙛𝙧𝙚 • 𝙘𝙤𝙛𝙛𝙚𝙧
> ﹙✐﹚ ⚘ 𝙬𝙚𝙚𝙠𝙡𝙮 • 𝙨𝙚𝙢𝙖𝙣𝙖𝙡
> ﹙✐﹚ ⚘ 𝙢𝙤𝙣𝙩𝙝𝙡𝙮 • 𝙢𝙚𝙣𝙨𝙪𝙖𝙡
> ﹙✐﹚ ⚘ 𝙨𝙩𝙚𝙖𝙡 • 𝙧𝙤𝙗𝙖𝙧 • 𝙧𝙤𝙗 + [@mencion]
> ﹙✐﹚ ⚘ 𝙚𝙘𝙤𝙣𝙤𝙢𝙮𝙗𝙤𝙖𝙧𝙙 • 𝙚𝙗𝙤𝙖𝙧𝙙 • 𝙗𝙖𝙡𝙩𝙤𝙥
> ﹙✐﹚ ⚘ 𝙖𝙫𝙚𝙣𝙩𝙪𝙧𝙖 • 𝙖𝙙𝙫𝙚𝙣𝙩𝙪𝙧𝙚
> ﹙✐﹚ ⚘ 𝙘𝙪𝙧𝙖𝙧 • 𝙝𝙚𝙖𝙡
> ﹙✐﹚ ⚘ 𝙘𝙖𝙯𝙖𝙧 • 𝙝𝙪𝙣𝙩
> ﹙✐﹚ ⚘ 𝙛𝙞𝙨𝙝 • 𝙥𝙚𝙨𝙘𝙖𝙧
> ﹙✐﹚ ⚘ 𝙢𝙖𝙯𝙢𝙤𝙧𝙧𝙖 • 𝙙𝙪𝙣𝙜𝙚𝙤𝙣

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ՏIՏTᗴᗰᗩ ᗪᗴ ᗪᗴՏᑕᗩᖇᘜᗩՏ* ❐
> ﹙✐﹚ *Comandos para descargar*

> ﹙✐﹚ ⚘ 𝙩𝙞𝙠𝙩𝙤𝙠 • 𝙩𝙩 • 𝙩𝙩𝙖𝙪𝙙𝙞𝙤 + [Link] / [búsqueda]
> ﹙✐﹚ ⚘ 𝙢𝙚𝙙𝙞𝙖𝙛𝙞𝙧𝙚 • 𝙢𝙛 + [Link]
> ﹙✐﹚ ⚘ 𝙢𝙚𝙜𝙖 • 𝙢𝙜 + [Link]
> ﹙✐﹚ ⚘ 𝙥𝙡𝙖𝙮 • 𝙥𝙡𝙖𝙮𝙫𝙞𝙙 • 𝙮𝙩𝙢𝙥3 + [Canción] / [Link]
> ﹙✐﹚ ⚘ 𝙥𝙡𝙖𝙮2 • 𝙥𝙡𝙖𝙮3 • 𝙥𝙡𝙖𝙮4 + [Canción]
> ﹙✐﹚ ⚘ 𝙛𝙖𝙘𝙚𝙗𝙤𝙤𝙠 • 𝙛𝙗 + [Link]
> ﹙✐﹚ ⚘ 𝙩𝙬𝙞𝙩𝙩𝙚𝙧 • 𝙭 + [Link]
> ﹙✐﹚ ⚘ 𝙞𝙜 • 𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢 + [Link]
> ﹙✐﹚ ⚘ 𝙥𝙞𝙣𝙩𝙚𝙧𝙚𝙨𝙩 • 𝙥𝙞𝙣 + [búsqueda] / [Link]
> ﹙✐﹚ ⚘ 𝙞𝙢𝙖𝙜𝙚 • 𝙞𝙢𝙖𝙜𝙚𝙣 + [búsqueda]
> ﹙✐﹚ ⚘ 𝙖𝙥𝙠 • 𝙢𝙤𝙙𝙖𝙥𝙠 + [búsqueda]
> ﹙✐﹚ ⚘ 𝙮𝙩𝙨𝙚𝙖𝙧𝙘𝙝 • 𝙨𝙚𝙖𝙧𝙘𝙝 + [búsqueda]

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ՏIՏTᗴᗰᗩ ᗪᗴ ᘜᗩᑕᕼᗩ* ❐
> ﹙✐﹚ *Colecciona tus personajes favoritos*

> ﹙✐﹚ ⚘ 𝙗𝙪𝙮𝙘𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧 • 𝙗𝙪𝙮𝙘𝙝𝙖𝙧 + [nombre]
> ﹙✐﹚ ⚘ 𝙘𝙝𝙖𝙧𝙞𝙢𝙖𝙜𝙚 • 𝙘𝙞𝙢𝙖𝙜𝙚 + [nombre]
> ﹙✐﹚ ⚘ 𝙘𝙝𝙖𝙧𝙞𝙣𝙛𝙤 • 𝙬𝙞𝙣𝙛𝙤 + [nombre]
> ﹙✐﹚ ⚘ 𝙘𝙡𝙖𝙞𝙢 • 𝙘 + {citar personaje}
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡𝙘𝙡𝙖𝙞𝙢𝙢𝙨𝙜
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡𝙚𝙩𝙚𝙬𝙖𝙞𝙛𝙪 • 𝙙𝙚𝙡𝙬𝙖𝙞𝙛𝙪 + [nombre]
> ﹙✐﹚ ⚘ 𝙛𝙖𝙫𝙤𝙧𝙞𝙩𝙚𝙩𝙤𝙥 • 𝙛𝙖𝙫𝙩𝙤𝙥
> ﹙✐﹚ ⚘ 𝙜𝙖𝙘𝙝𝙖𝙞𝙣𝙛𝙤 • 𝙜𝙞𝙣𝙛𝙤
> ﹙✐﹚ ⚘ 𝙜𝙞𝙫𝙚𝙖𝙡𝙡𝙝𝙖𝙧𝙚𝙢 + [@usuario]
> ﹙✐﹚ ⚘ 𝙜𝙞𝙫𝙚𝙘𝙝𝙖𝙧 • 𝙜𝙞𝙫𝙚𝙬𝙖𝙞𝙛𝙪 + [@usuario] [nombre]
> ﹙✐﹚ ⚘ 𝙧𝙤𝙗𝙬𝙖𝙞𝙛𝙪 • 𝙧𝙤𝙗𝙖𝙧𝙬𝙖𝙞𝙛𝙪 + [@usuario]
> ﹙✐﹚ ⚘ 𝙝𝙖𝙧𝙚𝙢 • 𝙬𝙖𝙞𝙛𝙪𝙨 • 𝙘𝙡𝙖𝙞𝙢𝙨 + <@usuario>
> ﹙✐﹚ ⚘ 𝙝𝙖𝙧𝙚𝙢𝙨𝙝𝙤𝙥 • 𝙬𝙨𝙝𝙤𝙥 + <Página>
> ﹙✐﹚ ⚘ 𝙧𝙚𝙢𝙤𝙫𝙚𝙨𝙖𝙡𝙚 + [precio] [nombre]
> ﹙✐﹚ ⚘ 𝙧𝙤𝙡𝙡𝙬𝙖𝙞𝙛𝙪 • 𝙧𝙬 • 𝙧𝙤𝙡𝙡
> ﹙✐﹚ ⚘ 𝙨𝙚𝙡𝙡 • 𝙫𝙚𝙣𝙙𝙚𝙧 + [precio] [nombre]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙧𝙞𝙚𝙞𝙣𝙛𝙤 • 𝙖𝙞𝙣𝙛𝙤 + [nombre]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙧𝙞𝙚𝙡𝙞𝙨𝙩 • 𝙨𝙡𝙞𝙨𝙩
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙘𝙡𝙖𝙞𝙢𝙢𝙨𝙜 • 𝙨𝙚𝙩𝙘𝙡𝙖𝙞𝙢 + [mensaje]
> ﹙✐﹚ ⚘ 𝙩𝙧𝙖𝙙𝙚 • 𝙞𝙣𝙩𝙚𝙧𝙘𝙖𝙢𝙗𝙞𝙖𝙧 + [personaje1] / [personaje2]
> ﹙✐﹚ ⚘ 𝙫𝙤𝙩𝙚 • 𝙫𝙤𝙩𝙖𝙧 + [nombre]
> ﹙✐﹚ ⚘ 𝙬𝙖𝙞𝙛𝙪𝙨𝙗𝙤𝙖𝙧𝙙 • 𝙬𝙖𝙞𝙛𝙪𝙨𝙩𝙤𝙥 • 𝙬𝙩𝙤𝙥

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ՏIՏTᗴᗰᗩ ᗪᗴ Տᑌᗷ-ᗷOT* ❐
> ﹙✐﹚ *Registra tu propio Bot*

> ﹙✐﹚ ⚘ 𝙦𝙧 • 𝙘𝙤𝙙𝙚
> ﹙✐﹚ ⚘ 𝙗𝙤𝙩𝙨 • 𝙗𝙤𝙩𝙡𝙞𝙨𝙩
> ﹙✐﹚ ⚘ 𝙨𝙩𝙖𝙩𝙪𝙨 • 𝙚𝙨𝙩𝙖𝙙𝙤
> ﹙✐﹚ ⚘ 𝙥 • 𝙥𝙞𝙣𝙜
> ﹙✐﹚ ⚘ 𝙟𝙤𝙞𝙣 + [Invitación]
> ﹙✐﹚ ⚘ 𝙡𝙚𝙖𝙫𝙚 • 𝙨𝙖𝙡𝙞𝙧
> ﹙✐﹚ ⚘ 𝙡𝙤𝙜𝙤𝙪𝙩
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙥𝙛𝙥 • 𝙨𝙚𝙩𝙞𝙢𝙖𝙜𝙚
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙨𝙩𝙖𝙩𝙪𝙨 + [estado]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙪𝙨𝙚𝙧𝙣𝙖𝙢𝙚 + [nombre]

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ᕼᗴᖇᗰIᗴᑎTᗩՏ* ❐
> ﹙✐﹚ *Comandos útiles*

> ﹙✐﹚ ⚘ 𝙝𝙚𝙡𝙥 • 𝙢𝙚𝙣𝙪
> ﹙✐﹚ ⚘ 𝙨𝙘 • 𝙨𝙘𝙧𝙞𝙥𝙩
> ﹙✐﹚ ⚘ 𝙨𝙪𝙜 • 𝙨𝙪𝙜𝙜𝙚𝙨𝙩
> ﹙✐﹚ ⚘ 𝙧𝙚𝙥𝙤𝙧𝙩𝙚 • 𝙧𝙚𝙥𝙤𝙧𝙩𝙖𝙧
> ﹙✐﹚ ⚘ 𝙘𝙖𝙡𝙘𝙪𝙡𝙖𝙧 • 𝙘𝙖𝙡
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡𝙢𝙚𝙩𝙖
> ﹙✐﹚ ⚘ 𝙜𝙚𝙩𝙥𝙞𝙘 • 𝙥𝙛𝙥 + [@usuario]
> ﹙✐﹚ ⚘ 𝙨𝙖𝙮 + [texto]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙢𝙚𝙩𝙖 + [autor] | [pack]
> ﹙✐﹚ ⚘ 𝙨𝙩𝙞𝙘𝙠𝙚𝙧 • 𝙨 • 𝙬𝙢 + {citar imagen/video}
> ﹙✐﹚ ⚘ 𝙩𝙤𝙞𝙢𝙜 • 𝙞𝙢𝙜 + {citar sticker}
> ﹙✐﹚ ⚘ 𝙗𝙧𝙖𝙩 • 𝙗𝙧𝙖𝙩𝙫 • 𝙦𝙘 • 𝙚𝙢𝙤𝙟𝙞𝙢𝙞𝙭
> ﹙✐﹚ ⚘ 𝙜𝙞𝙩𝙘𝙡𝙤𝙣𝙚 + [Link]
> ﹙✐﹚ ⚘ 𝙚𝙣𝙝𝙖𝙣𝙘𝙚 • 𝙧𝙚𝙢𝙞𝙣𝙞 • 𝙝𝙙
> ﹙✐﹚ ⚘ 𝙡𝙚𝙩𝙧𝙖 • 𝙨𝙩𝙮𝙡𝙚
> ﹙✐﹚ ⚘ 𝙧𝙚𝙖𝙙 • 𝙧𝙚𝙖𝙙𝙫𝙞𝙚𝙬𝙤𝙣𝙘𝙚
> ﹙✐﹚ ⚘ 𝙨𝙨 • 𝙨𝙨𝙬𝙚𝙗
> ﹙✐﹚ ⚘ 𝙩𝙧𝙖𝙣𝙨𝙡𝙖𝙩𝙚 • 𝙩𝙧𝙖𝙙𝙪𝙘𝙞𝙧 • 𝙩𝙧𝙖𝙙
> ﹙✐﹚ ⚘ 𝙞𝙖 • 𝙜𝙚𝙢𝙞𝙣𝙞
> ﹙✐﹚ ⚘ 𝙩𝙤𝙪𝙧𝙡 • 𝙘𝙖𝙩𝙗𝙤𝙭
> ﹙✐﹚ ⚘ 𝙬𝙞𝙠𝙞 • 𝙬𝙞𝙠𝙞𝙥𝙚𝙙𝙞𝙖
> ﹙✐﹚ ⚘ 𝙙𝙖𝙡𝙡𝙚 • 𝙛𝙡𝙪𝙭
> ﹙✐﹚ ⚘ 𝙣𝙥𝙢𝙙𝙡 • 𝙣𝙢𝙥𝙟𝙨
> ﹙✐﹚ ⚘ 𝙜𝙤𝙤𝙜𝙡𝙚

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ՏIՏTᗴᗰᗩ ᗪᗴ ᑭᗴᖇᖴIᒪՏ* ❐
> ﹙✐﹚ Configura tu perfil

> ﹙✐﹚ ⚘ 𝙡𝙚𝙖𝙙𝙚𝙧𝙗𝙤𝙖𝙧𝙙 • 𝙡𝙗𝙤𝙖𝙧𝙙 • 𝙩𝙤𝙥 + <Página>
> ﹙✐﹚ ⚘ 𝙡𝙚𝙫𝙚𝙡 • 𝙡𝙫𝙡 + <@Mencion>
> ﹙✐﹚ ⚘ 𝙢𝙖𝙧𝙧𝙮 • 𝙘𝙖𝙨𝙖𝙧𝙨𝙚 + <@Mencion>
> ﹙✐﹚ ⚘ 𝙥𝙧𝙤𝙛𝙞𝙡𝙚 + <@Mencion>
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙗𝙞𝙧𝙩𝙝 + [fecha]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙙𝙚𝙨𝙘𝙧𝙞𝙥𝙩𝙞𝙤𝙣 • 𝙨𝙚𝙩𝙙𝙚𝙨𝙘 + [Descripción]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙜𝙚𝙣𝙧𝙚 + Hombre | Mujer
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡𝙜𝙚𝙣𝙧𝙚 • 𝙙𝙚𝙡𝙜𝙚𝙣𝙚𝙧𝙤
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡𝙗𝙞𝙧𝙩𝙝 + [fecha]
> ﹙✐﹚ ⚘ 𝙙𝙞𝙫𝙤𝙧𝙘𝙚
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙛𝙖𝙫𝙤𝙪𝙧𝙞𝙩𝙚 • 𝙨𝙚𝙩𝙛𝙖𝙫 + [Personaje]
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡𝙙𝙚𝙨𝙘𝙧𝙞𝙥𝙩𝙞𝙤𝙣 • 𝙙𝙚𝙡𝙙𝙚𝙨𝙘
> ﹙✐﹚ ⚘ 𝙥𝙧𝙚𝙢 • 𝙫𝙞𝙥

> ꒰⌢ ʚ˚₊‧ ✎ ꒱ ❐ *ՏIՏTᗴᗰᗩ ᑭᗩᖇᗩ ᘜᖇᑌᑭOՏ* ❐
> ﹙✐﹚ Comandos para administradores

> ﹙✐﹚ ⚘ 𝙩𝙖𝙜 • 𝙝𝙞𝙙𝙚𝙩𝙖𝙜 • 𝙞𝙣𝙫𝙤𝙘𝙖𝙧 + [mensaje]
> ﹙✐﹚ ⚘ 𝙙𝙚𝙩𝙚𝙘𝙩 • 𝙖𝙡𝙚𝙧𝙩𝙖𝙨 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙖𝙣𝙩𝙞𝙡𝙞𝙣𝙠 • 𝙖𝙣𝙩𝙞𝙚𝙣𝙡𝙖𝙘𝙚 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙗𝙤𝙩 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙘𝙡𝙤𝙨𝙚 • 𝙘𝙚𝙧𝙧𝙖𝙧
> ﹙✐﹚ ⚘ 𝙙𝙚𝙢𝙤𝙩𝙚 + <@usuario>
> ﹙✐﹚ ⚘ 𝙚𝙘𝙤𝙣𝙤𝙢𝙮 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙜𝙖𝙘𝙝𝙖 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙬𝙚𝙡𝙘𝙤𝙢𝙚 • 𝙗𝙞𝙚𝙣𝙫𝙚𝙣𝙞𝙙𝙖 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙗𝙮𝙚 + [texto]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙥𝙧𝙞𝙢𝙖𝙧𝙮 + [@bot]
> ﹙✐﹚ ⚘ 𝙨𝙚𝙩𝙬𝙚𝙡𝙘𝙤𝙢𝙚 + [texto]
> ﹙✐﹚ ⚘ 𝙠𝙞𝙘𝙠 + <@usuario>
> ﹙✐﹚ ⚘ 𝙤𝙣𝙡𝙮𝙖𝙙𝙢𝙞𝙣 + [enable/disable]
> ﹙✐﹚ ⚘ 𝙤𝙥𝙚𝙣 • 𝙖𝙗𝙧𝙞𝙧
> ﹙✐﹚ ⚘ 𝙥𝙧𝙤𝙢𝙤𝙩𝙚 + <@usuario>
> ﹙✐﹚ ⚘ 𝙖𝙙𝙙 • 𝙖ñ𝙖𝙙𝙞𝙧 + {número}
> ﹙✐﹚ ⚘ 𝙖𝙙𝙢𝙞𝙣𝙨 • 𝙖𝙙𝙢𝙞𝙣 + [texto]
> ﹙✐﹚ ⚘ 𝙧𝙚𝙨𝙩𝙖𝙗𝙡𝙚𝙘𝙚𝙧 • 𝙧𝙚𝙫𝙤𝙠𝙚
> ﹙✐﹚ ⚘ 𝙖𝙙𝙙𝙬𝙖𝙧𝙣 • 𝙬𝙖𝙧𝙣 + <@usuario>
> ﹙✐﹚ ⚘ 𝙪𝙣𝙬𝙖𝙧𝙣 • 𝙙𝙚𝙡𝙬𝙖𝙧𝙣 + <@usuario>
> ﹙✐﹚ ⚘ 𝙖𝙙𝙫𝙡𝙞𝙨𝙩 • 𝙡𝙞𝙨𝙩𝙖𝙙𝙫
> ﹙✐﹚ ⚘ 𝙞𝙣𝙖𝙘𝙩𝙞𝙫𝙤𝙨 • 𝙠𝙞𝙘𝙠𝙞𝙣𝙖𝙘𝙩𝙞𝙫𝙤𝙨
> ﹙✐﹚ ⚘ 𝙡𝙞𝙨𝙩𝙣𝙪𝙢 • 𝙠𝙞𝙘𝙠𝙣𝙪𝙢 [texto]
> ﹙✐﹚ ⚘ 𝙜𝙥𝙗𝙖𝙣𝙣𝙚𝙧 • 𝙜𝙧𝙤𝙪𝙥𝙞𝙢𝙜
> ﹙✐﹚ ⚘ 𝙜𝙥𝙣𝙖𝙢𝙚 • 𝙜𝙧𝙤𝙪𝙥𝙣𝙖𝙢𝙚 [texto]
> ﹙✐﹚ ⚘ 𝙜𝙥𝙙𝙚𝙨𝙘 • 𝙜𝙧𝙤𝙪𝙥𝙙𝙚𝙨𝙘 [texto]
> ﹙✐﹚ ⚘ 𝙙𝙚𝙡 • 𝙙𝙚𝙡𝙚𝙩𝙚 + {citar mensaje}
> ﹙✐﹚ ⚘ 𝙡𝙞𝙣𝙚𝙖 • 𝙡𝙞𝙨𝙩𝙤𝙣𝙡𝙞𝙣𝙚
> ﹙✐﹚ ⚘ 𝙜𝙥 • 𝙞𝙣𝙛𝙤𝙜𝙧𝙪𝙥𝙤
> ﹙✐﹚ ⚘ 𝙡𝙞𝙣𝙠

> ⚘️ 𝑵𝑰𝒏𝒐 𝑵𝒂𝒌𝒂𝒏𝒐 ✨
`.trim()

await conn.sendMessage(m.chat, { 
text: txt,
contextInfo: {
mentionedJid: [userId],
isForwarded: true,
forwardedNewsletterMessageInfo: {
newsletterJid: channelRD.id,
serverMessageId: '',
newsletterName: channelRD.name
},
externalAdReply: {
title: botname,
body: textbot,
mediaType: 1,
mediaUrl: redes,
sourceUrl: redes,
thumbnail: await (await fetch(banner)).buffer(),
showAdAttribution: false,
containsAutoReply: true,
renderLargerThumbnail: true
}}}, { quoted: m })
}

handler.help = ['menu']
handler.tags = ['main']
handler.command = ['menu', 'menú', 'help']
handler.register = true

export default handler
